app/controllers/assistances_controller.rb

  def index
    @assistances = Assistance.all
---
SELECT `assistances`.* FROM `assistances`