app/controllers/bill_products_controller.rb

  def index
    @bill_products = BillProduct.all
---
SELECT `bill_products`.* FROM `bill_products`