app/controllers/bills_controller.rb

SELECT `bills`.* FROM `bills`
---
  def index
    @bills = Bill.all

INSERT INTO `bills` (`numero`, `razon_social`, `giro_comercial`, `monto_neto`, `iva`, `total`, `customer_id`, `fecha`, `created_at`, `updated_at`) VALUES (12, 'Hola Mundo', 'Holywis', 12345.0, 102.0, 12345.0, 1, '2016-06-09', '2016-06-09 03:47:15', '2016-06-09 03:47:15')
---
  def create
    @bill = Bill.new(bill_params)
    @bill.cantidades = params[:cantidadesProducts]
    @bill.products = params[:products]

    respond_to do |format|
      if @bill.save

SELECT  `bills`.* FROM `bills` WHERE `bills`.`id` = 0 LIMIT 1
---
    def set_bill
      @bill = Bill.find(params[:id])