app/controllers/customer_matters_controller.rb

SELECT `customer_matters`.* FROM `customer_matters`
---
  def index
    @customer_matters = CustomerMatter.all