app/controllers/customers_controller.rb

INSERT INTO `customers` (`nombre`, `rut`, `telefono`, `email`, `direccion`, `created_at`, `updated_at`) VALUES ('Diego Garcia', '18168942-0', 97397829, 'garcia.castillo23@gmail.com', 'koiko 7524', '2016-06-09 18:15:13', '2016-06-09 18:15:13')
---
  def create
    @customer = Customer.new(customer_params)
    respond_to do |format|
      if @customer.save

UPDATE `customers` SET `direccion` = 'koiko 7525', `updated_at` = '2016-06-09 18:15:22' WHERE `customers`.`id` = 1
---
  def update
    respond_to do |format|
      if @customer.update(customer_params)