app/controllers/matters_controller.rb

SELECT `matters`.* FROM `matters`
---
  def index
    @matters = Matter.all