app/controllers/matter_products_controller.rb

SELECT `matter_products`.* FROM `matter_products`
---
  def index
    @matter_products = MatterProduct.all